#
# teleportator.jl
#

type Авто end
скорость(::Авто) = 60

type Самолет end
скорость(::Самолет) = 500

function перемещаться(точкаA, точкаB, средства...)
    скорости = map(скорость, средства)
    idx = findmax(скорости)[2]
    println("""
    Мне не всегда приходится быстро перемещаться, но когда нужно, 
    я предпочитаю $(lowercase(string(typeof(средства[idx])))).\n""")
end

перемещаться(1, 2, Авто(), Самолет())

# добавим другой тип

type Телепортатор end
скорость(::Телепортатор) = Inf

перемещаться(1, 2, Авто(), Самолет(), Телепортатор())

